app/views/nodes/_form.html.erb


<% @flow = Flow.all %>
---
SELECT `flows`.* FROM `flows`

    <% else %>
      <td><div id="flow_div"><%= render :partial => 'filter_nodes', :locals => {:@f => Flow.last, :@fname => "node_id_parent"} %></div></td>
---
SELECT  `flows`.* FROM `flows`  ORDER BY `flows`.`id` DESC LIMIT 1