app/views/users/_flows.html.erb

      <span class="fd01"><%= flow.name %></span>
      <span class="fd02"><%= flow.nodes.count %></span>
---
SELECT COUNT(*) FROM `nodes`  WHERE `nodes`.`flow_id` = 1