app/views/node_pages/new_data_entry.html.erb

		<td>Flow Name</td>
		<td><%= collection_select 'dataentry', 'flow_id', Flow.all, 'id', 'name', {:selected => @node.flow_id}, :name => "dataentry[][flow_id]" %></td>
---
SELECT `flows`.* FROM `flows`

		<td>Node Name</td>
		<td><%= collection_select 'data_entry', 'node_id', Node.where("flow_id in (?)", @node.flow.id), 'id', 'name', {:selected => @node.id}, :name => "data_entry[][node_id]" %></td>
---
SELECT  `flows`.* FROM `flows`  WHERE `flows`.`id` = 1 LIMIT 1
SELECT `nodes`.* FROM `nodes`  WHERE (flow_id in (1))

		<td>View Permission User Role</td>
		<td><%= collection_select 'data_entry', 'role_id', Role.where("name != ?", "Admin"), 'id', 'name', {}, :name => "data_entry[][role_id]" %></td>
---
SELECT `roles`.* FROM `roles`  WHERE (name != 'Admin')