app/controllers/nodes_controller.rb

  def create
    @node = Node.new(params[:node])

      if @node.save
---
INSERT INTO `nodes` (`created_at`, `duration`, `flow_id`, `name`, `node_id_parent`, `node_id_task_starter`, `node_type`, `parent_value`, `role_id`, `sql`, `updated_at`) VALUES ('2014-06-11 12:56:29', NULL, 1, 'node1', NULL, NULL, 'Data Entry', NULL, 1, '', '2014-06-11 12:56:29')