app/controllers/node_pages_controller.rb

  def new_data_entry
    @node = Node.find(params[:node])
---
SELECT  `nodes`.* FROM `nodes`  WHERE `nodes`.`id` = 11 LIMIT 1