app/controllers/registrations_controller.rb

SELECT `roles`.* FROM `roles`
---
	def new
		@roles = Role.all